//app.js
App({
  onLaunch: function () {
    // 展示本地存储能力
    var logs = wx.getStorageSync('logs') || []
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)
  },

  globalData: {
    harmfulTrush: ['充电电池', '镉镍电池', '铅酸电池', '蓄电池', '纽扣电池', '荧光灯詧', '曰光灯詧', '卤素灯', '药品', '药品内包装', '油漆桶', '染发剂壳', '指甲油', '洗甲水', '矿物油及包装', '含水银温度计', '含水银血压计', '老鼠药', '杀虫喷雾罐', '消毒剂', 'X光片', '相片底片'],


    wetTrush: ['五谷杂粮', '米面豆制品', '肉', '内脏', '蛋', '蛋壳', '鱼', '鱼骨', '虾', '虾壳', '鱿鱼', '蔬菜', '菌菇', '调料/酱料', '小骨/碎骨 ',
      '茶叶渣', '咖啡渣', '糕饼', '糖朱', '肉干', '香菇干', '宠物饲料', '果肉', '软果皮', '软果籽', '家养绿植', '中药材', '中药药渣'
    ],

    recycleTrush: ['纸板箱', '书本', '打印纸', '广告单', '饮料瓶', '洗发水瓶', '食用油桶', '塑料盒', '塑料衣架', 'PVC塑料', '塑料卡片', '泡沬塑料', '调料瓶', '化妆品瓶', '碎玻璃', '易拉罐', '莱刀', '刀片', '螺丝刀', '铁皮', '旧衣服', '枕头', '皮鞋', '棉袄', '皮带', '电路板', '电线', '报纸', '快递纸袋', '信封', '利乐包', '奶瓶', '乳液罐', '塑料碗盆', '塑料玩具', 'PE塑料', '亚克力板', 'KT板', '帆布袋', '酒瓶', '玻璃杯', '放大镜', '小型木制品', '食品罐桶', '锅', '指甲钳', '铁钉', '铝箔', '床单', '棉被', '毛绒玩具', '包', '丝绸制品', '充电宝/U盘', '家电'],

    dryTrush: ['大骨头', '椰子壳', '核桃壳', '甘蔗皮', '榴莲核', '餐巾纸', '一次性纸杯', '一次性手套', '尿不湿', '卫生巾', '眼影', '粉底液', '防晒霜', '卸妆棉', '棉签', '假睫毛', '污损塑料袋', '丝袜', '污损纸张', '猫砂', '干燥剂', '编织袋',
      '毛发', '炉渣', '胶带', '竹制品', '打火机', '伞', '硬贝壳', '榴莲壳', '玉米衣', '粽叶', '菠萝蜜核', '卫生间用纸', '一次性餐具', '零食包装袋', '湿纸巾', '面膜', '口红', '睫毛眘', '护肤霜', '卸妆油', '粉扑', '隐形眼镜', '毛巾', '内衣',
      '玻璃钢', '狗尿垫', '烟蒂', '尼龙制品', '防碎气泡膜', '灰土', '橡皮泥', '陶瓷碗盆', '镜子', '笔'
    ],
  }
})